using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class PokemonHouseEvent : PokeEvent
{
	public override void OnPokeEvent(GameObject player)
	{

		/*
이야이야
네가 player.name군이로군
공박사로부터 
연락이 있어서 기다리고 있었단다

플레이어 할아버지에게  이동

이것이 공박사에게
조사를 의뢰하고싶은 것이란다!
player.name은
포켓몬 할아버지로부터
이상한 알을 받았다.
이상한 알을
중요한 포켓에 넣었다
포켓몬을 맡아 기르고 있는
부부가 있는데
거기서 얻은 것이란다
혹시 그렇다면.... 라고 생각해서
공박사에게 메일을 보냈단다
포켓몬 진화의 연구라면 
공박사가 최고니까
여하튼 이 오박사도 
인정하는 정도니까

오박사 플레이어에게 다가옴

내 상상이 맞았는가...
공박사라면 알고있을 터

(npc 옆 노란머리 말걸어옴)
오박사"호오!
네가 player.name군인가!
나는 오박사
포켓몬 연구를 하고있단다
오랜 친구인 
포켓몬 할아버지를 방문 해보니까
공박사가 있는 곳으로부터
심부름군이 온다고 들어서
기다리고 있었단다!
호오!
진귀한 포켓몬을 가지고 있구나
게다가.....
흐음 역시!
공박사가 포켓몬을 줘서 
너에게 심부름을 부탁한 이유를
잘 알겠구나
나와 공박사같은 
연구가에게 있어서 포켓몬은
소중한 친구이기 때문이란다
너라면 포켓몬을 소중하게 
키울 것 이라 생각한단다
....그렇구나!
너에게 기대를 걸고 나도
한가지 부탁을 할까!
실은......
이것이 포켓몬 도감이란다
발견한 포켓몬의 데이터가
자동적으로 기록되어져
페이지가 늘어간다고 하는
하이테크 도감이란다
(포켓몬 도감을 획득하였습니다)
많은 포켓몬과 만나서
이 도감을 완전하게
만들어 주었으면 좋겠구나
이런!
오랫동안 시간을 끌었구나
이제부터 김빛시티에 가서 늘
그렇듯이 라디오 방송을
녹음하지 않으면 안 되겠구나
그럼 player.name군
잘 부탁한다
(오박사)

npc할배박사
공박사가 계신곳에 돌아갈 작정인가?
약간 포켓몬을 쉬게 하는것이 좋겠지

포켓몬 치료 이벤트

그럼 잘 부탁한다!
		 */
	}
}
