using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class StarterEvent : PokeEvent
{

	public override void OnPokeEvent(GameObject player)
	{
		/* 
		 입장 시 트리게 발생

		공박사의 바로 옆 좌표까지 플레이어 이동 -12,16
		
		여어 골드군, 기다리고 있었단다!
		오늘 너를 부른 것은 바탁이 있어서란다!
		내가 아는 사람중에
		포켓몬 할아버지라고 하는 
		이상한 것을 발견했을 때
		대발견! 이라고 떠드는 
		할아버지가 있단다.

		그리고 전에
		이번만큼은 진짜야!
		라는 메일이 왔단다.
		호기심이 생기지만 나도 조수도 
		포켓몬연구로 바빠서 말이다.
		네가 대신 가줬으면 좋겠구나

		물론 파트너가 될 포켓몬을 주겠다
		최근에 발견한 진귀한 포켓몬이란다
		자 고르거라!




		포켓몬 미분양 나가기 시도 시 
		(-12,8), (-10,8)
		잠깐 잠깐 어디에 가느냐!
		플레이어 한 칸 위로

		포켓몬 선택지 대사
		
		case
		불꽃의 포켓몬 브케인으로 하겠니!?
		물포켓몬 리아코가 마음에 드느냐!?
		풀포켓몬 치코리타가 마음에 들었느냐!?
		차분히 생각하여 정하는 것이 좋을꺼다
		소중한 파트너가 될테니까


		나도 이 녀석은 최고의 포켓몬이라고 생각한다!
		콜드는 공박사한테
		player.name은 공박사한테
		okemon.name을 받았다

		받은 pokemon.name에게
		이름을 붙이겠습니까? 예/아니오
			
		공박사에게 다가감
		포켓몬 할아버지가 계신 곳은 
		이마을 근처의
		무궁시티 끝이란다
		거기까지는 거의 외길이니까
		찾기 쉬울꺼다
		포켓몬이 상처를 입었다면
		저쪽에 있는 기계로
		포켓몬을 회복시켜주거라
		참 내 전화번호를 
		알려줄테니까
		무슨 일이 있으면 연락하거라!
		player.name은 공박사님의 
		전화번호를 등록했다
		 */
	}
}
